%% @author IcLod
%% @doc @todo Add description to event_handler.


%% ====================================================================
%% Head
%% ====================================================================
-module(event_handler).
-export([make/1,add_handler/2,event/2]).
%% ====================================================================
%% define
%% ====================================================================


%% ====================================================================
%% API functions
%% ====================================================================

%%	制作一个"什么都不干" 的事件处理器Name(原子),消息就有地方发送了
make(Name) ->
	register(Name, spawn(fun() -> my_handler(fun no_op/1) end)).

%%	发送消息X到名为Name的事件处理
event(Name, X) -> Name ! {event, X}.

%%	给名为Name的事件处理器添加一个处理函数Fun,当事件X发生时,事件处理器就会执行Fun(X)
add_handler(Name, Fun) -> Name ! {add, Fun}.



%%	
my_handler(Fun) ->
	receive
		{add, Fun1} ->
			my_handler(Fun1);
		{event, Any} ->
			(catch Fun(Any)),
			my_handler(Fun)
	end.
no_op(_) -> void.



%% ====================================================================
%% Internal functions
%% ====================================================================


